Tekla Open API Reference for Tekla Structures 2025
AnalysisModelDesignProperties Properties
The AnalysisModelDesignProperties type exposes the following members.
Properties
Name | Description
ConcreteDesign
 The concrete code used.
ConcreteDesignMethod
 The concrete design method.
SteelDesign
 The steel code used.
SteelDesignMethod
 The steel design method.
TimberDesign
 The timber code used.
TimberDesignMethod
 The timber design method.
Top
See Also
Reference
AnalysisModelDesignProperties Class
Tekla.Structures.Analysis Namespace